[
  {
    "id": 1,
    "date": "2025-03-21",
    "title": "Announcing EDU TECH EDUTECH EXPO 2025: South & Central India’s Premier EdTech Conclave",
    "content": "The Ministry of Ayush and FIT INDIA proudly present EDUTECH EXPO 2025, South and Central India’s largest educational conclave, set for August 2025 in Hyderabad. This two-day event will unite over 700 school leaders, 150 higher education administrators, 130 EdTech corporates, and 50+ government dignitaries. Attendees from Telangana, Karnataka, Tamil Nadu, Andhra Pradesh, Maharashtra, Chhattisgarh, Madhya Pradesh, and Goa will explore cutting-edge EdTech solutions, network with industry leaders, and participate in conferences and awards. Exhibitors gain direct access to decision-makers, high-quality leads, and unparalleled brand visibility. Stay tuned for more updates!"
  },
  {
    "id": 2,
    "date": "2025-04-12",
    "title": "Unlock Opportunities: Partnership Tiers at EDU TECH EDUTECH EXPO 2025",
    "content": "EDUTECH EXPO 2025 offers tailored partnership packages to maximize your brand’s impact. As a Presenting Partner (₹12.5L + GST), enjoy logo prominence, 12 sqm booths, 40 award nominations, and keynote slots. Co-Powered Partners (₹10L + GST) secure 10 sqm booths, 20 meetings, and digital coverage. Gold Partners (₹6L + GST) gain prime booth locations and 10 guaranteed meetings. Exclusive categories like Lanyard Partner (₹3.5L + GST) provide branding on 1,200+ lanyards. Each tier includes webinar access, media promotions, and awards participation. Collaborate with us to shape the future of education technology!"
  },
  {
    "id": 3,
    "date": "2025-01-10",
    "title": "10 Reasons to Exhibit at EDUTECH EXPO 2025",
    "content": "1.Direct Access: Engage with K-12 principals, university deans, and policymakers. 2. Showcase Innovations: Demo products to 1,000+ attendees. 3. Strategic Location: Hyderabad’s hub connects South/Central India. 4. Brand Visibility: Sponsorships ensure logo placements and hoardings. 5. Lead Generation: Two days of focused networking. 6. Trend Insights: Learn educators’ needs through live feedback. 7. Product Launches: Debut solutions with instant user reactions. 8. Awards Recognition: Nominate clients for Grand Stand Awards. 9. Networking: Connect with EdTech startups and MNCs. 10. Media Reach: Pre- and post-event digital campaigns. Reserve your booth today!"
  },
  {
    "id": 4,
    "date": "2025-02-15",
    "title": "Grand Stand Awards: Celebrating Excellence in EdTech",
    "content": "The Grand Stand Awards at EDUTECH EXPO 2025 honor exhibitors driving innovation in education. Products/services are evaluated by a jury of school directors, principals, and policymakers based on impact, scalability, and creativity. Winners gain recognition in the *Education News Digest* magazine, media coverage, and a felicitation shield. Partners can nominate schools or clients for awards, enhancing their credibility. Don’t miss this chance to spotlight your contributions to India’s educational evolution. Nominations close July 31—submit yours now!"
  }
]